return {
  "nvimdev/dashboard-nvim",
  lazy = false,
  opts = function()
    local logo = [[
      ⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣴⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠛⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⣿⢻⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⢀⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡟⡇⡘⣧⠀⠀⠀⠀⠀⠀⣠⣾⡿⠁⡏⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠈⠩⢶⣄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠁⡇⣧⠘⣆⠀⠀⠀⣠⠞⠛⣿⢃⢤⠇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠙⢿⢄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡏⠀⣏⠻⡄⠸⣧⣠⣾⣇⣀⣰⠃⢸⣼⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠸⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢸⠃⠀⡏⠱⡇⠀⠹⠇⠀⠀⠀⠉⠀⠀⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣻⠤⠖⠤⣄⡀⠀⠀⠀⠀⠀⠀⣼⢀⠀⣷⠎⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⢢⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠺⣦⠀⠀⠀⠀⣠⠿⡌⠀⠉⠀⠀⠀⠀⠀⠀⠀⠀⠀⢢⡀⠀⠀⣷⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⢧⠀⠀⡰⠁⠀⢱⡀⡀⠀⠀⠀⠀⠀⠉⠒⠾⣤⣄⣹⠀⠀⢼⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠉⡺⠁⠀⠀⠀⠫⠤⢤⣀⠀⢀⣀⢤⣀⣀⣹⣿⣿⡇⠀⠈⠳⢄⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣰⡇⠀⠀⠀⠀⠀⢀⣴⠾⠝⠛⠂⠀⠀⠀⢒⡐⣂⣹⠷⠒⠂⠠⠬⠍⣐⣶⣤⠉⠉⠉⠒⠤⢼
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣠⣏⠀⠀⠀⠀⠀⢰⣛⣁⣀⢤⠖⠀⣀⡠⠤⠤⠤⠒⠠⢌⣉⠀⠀⠀⠀⢈⣿⠟⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⠏⠉⠀⠀⠀⢀⡴⠋⠁⠀⠀⠘⡴⠊⠁⠀⠀⢀⣴⠋⠉⠉⠉⠛⠛⠛⠛⠉⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢠⡎⠀⠀⠀⣤⣴⣁⡄⠀⠀⠀⢀⣀⡀⠀⡀⠀⣠⢯⢹⣦⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⡴⠍⠀⠀⠀⢀⡭⣤⠿⠓⠈⠉⠉⠉⢀⡧⠊⣇⣸⠟⢾⣧⣧⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⠅⠀⠀⠀⠀⠸⣰⣣⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠻⡄⠀⢳⣷⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀    ⠀⠀⠀⠀⠀⠀⠀⠞⣿⠀⠀⠀⠀⠀⠈⡧⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢈⠙⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀
⠀⠀⠀⠀⠀⠀

𝓨𝓸𝓾 𝓪𝓻𝓮 𝓶𝔂 𝓯𝓸𝔁, 𝓰𝓻𝓪𝓭𝓾𝓪𝓵𝓵𝔂 𝓾𝓷𝓿𝓮𝓲𝓵𝓲𝓷𝓰 𝔂𝓸𝓾𝓻𝓼𝓮𝓵𝓯, 𝓫𝓮𝓬𝓸𝓶𝓲𝓷𝓰 𝓾𝓷𝓲𝓺𝓾𝓮 𝓪𝓷𝓭 𝓼𝓹𝓮𝓬𝓲𝓪𝓵.
𝓘𝓷 𝓮𝓪𝓬𝓱 𝓸𝓯 𝔂𝓸𝓾𝓻 𝓰𝓮𝓼𝓽𝓾𝓻𝓮𝓼, 𝓘 𝓯𝓮𝓮𝓵 𝓽𝓱𝓮 𝓮𝓷𝓬𝓱𝓪𝓷𝓽𝓶𝓮𝓷𝓽 𝓸𝓯 𝔂𝓸𝓾𝓻 𝓮𝓼𝓼𝓮𝓷𝓬𝓮 𝓽𝓱𝓪𝓽 𝓬𝓪𝓹𝓽𝓲𝓿𝓪𝓽𝓮𝓼 𝓶𝓮.


𝓨𝓸𝓾 𝓪𝓻𝓮 𝓶𝔂 𝓼𝓲𝓷𝓰𝓾𝓵𝓪𝓻 𝓻𝓸𝓼𝓮 𝓲𝓷 𝓽𝓱𝓲𝓼 𝓿𝓪𝓼𝓽 𝓰𝓪𝓻𝓭𝓮𝓷 𝓸𝓯 𝓮𝔁𝓲𝓼𝓽𝓮𝓷𝓬𝓮, 𝓪 𝓼𝓽𝓪𝓻 𝓽𝓱𝓪𝓽 𝓫𝓻𝓲𝓰𝓱𝓽𝓮𝓷𝓼 𝓶𝔂 𝓭𝓪𝔂𝓼
𝔀𝓲𝓽𝓱 𝓽𝓱𝓮 𝓻𝓪𝓭𝓲𝓪𝓷𝓬𝓮 𝓸𝓯 𝔂𝓸𝓾𝓻 𝓮𝔂𝓮𝓼.

𝓜𝓪𝔂 𝓸𝓾𝓻 𝓼𝓽𝓸𝓻𝔂 𝓫𝓮 𝓵𝓲𝓴𝓮 𝓪 𝓼𝓸𝓷𝓷𝓮𝓽, 𝔀𝓱𝓮𝓻𝓮 𝔂𝓸𝓾, 𝓶𝔂 𝓵𝓲𝓽𝓽𝓵𝓮 𝓹𝓻𝓲𝓷𝓬𝓮, 𝓪𝓻𝓮 𝓽𝓱𝓮 𝓹𝓮𝓻𝓯𝓮𝓬𝓽 𝓻𝓱𝔂𝓶𝓮,
𝓽𝓱𝓮 𝓹𝓸𝓮𝓽𝓻𝔂 𝓽𝓱𝓪𝓽 𝓬𝓸𝓵𝓸𝓻𝓼 𝓮𝓿𝓮𝓷 𝓽𝓱𝓮 𝓰𝓻𝓮𝔂𝓮𝓼𝓽 𝓸𝓯 𝓭𝓪𝔂𝓼.
    ]]

    logo = string.rep("\n", 8) .. logo .. "\n\n"

    local opts = {
      theme = "doom",
      hide = {
        statusline = false,
      },
      config = {
        header = vim.split(logo, "\n"),
        center = {
          { action = 'lua LazyVim.pick()()',                           desc = " Find File",       icon = " ", key = "f" },
          { action = "ene | startinsert",                              desc = " New File",        icon = " ", key = "n" },
          { action = 'lua LazyVim.pick("oldfiles")()',                 desc = " Recent Files",    icon = " ", key = "r" },
          { action = 'lua LazyVim.pick("live_grep")()',                desc = " Find Text",       icon = " ", key = "g" },
          { action = 'lua LazyVim.pick.config_files()()',              desc = " Config",          icon = " ", key = "c" },
          { action = 'lua require("persistence").load()',              desc = " Restore Session", icon = " ", key = "s" },
          { action = "LazyExtras",                                     desc = " Lazy Extras",     icon = " ", key = "x" },
          { action = "Lazy",                                           desc = " Lazy",            icon = "󰒲 ", key = "l" },
          { action = function() vim.api.nvim_input("<cmd>qa<cr>") end, desc = " Quit",            icon = " ", key = "q" },
        },
        footer = function()
          local stats = require("lazy").stats()
          local ms = (math.floor(stats.startuptime * 100 + 0.5) / 100)
          return { "⚡ Neovim loaded " .. stats.loaded .. "/" .. stats.count .. " plugins in " .. ms .. "ms" }
        end,
      },
    }

    for _, button in ipairs(opts.config.center) do
      button.desc = button.desc .. string.rep(" ", 43 - #button.desc)
      button.key_format = "  %s"
    end

    if vim.o.filetype == "lazy" then
      vim.api.nvim_create_autocmd("WinClosed", {
        pattern = tostring(vim.api.nvim_get_current_win()),
        once = true,
        callback = function()
          vim.schedule(function()
            vim.api.nvim_exec_autocmds("UIEnter", { group = "dashboard" })
          end)
        end,
      })
    end

    return opts
  end,
}
